In [1]:
#sitaram dubagunta pc 50 240911624

import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt

In [2]:
 plt.rc("figure", figsize=(10, 6))
 pd.options.display.max_colwidth = 75
 pd.options.display.max_columns = 20
 np.set_printoptions(precision=4, suppress=True)

In [10]:
pd.read_csv("example/ex1.csv")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     for

In [11]:
 pd.read_csv("example/ex2.csv" , names = ["a" , "b" , "c" ,"d","message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     for

In [13]:
pd.read_csv("example/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    for

In [15]:
names = ["a", "b", "c", "d", "message"]

In [16]:
pd.read_csv("example/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
for      9  10  11  12

In [19]:
parsed = pd.read_csv("example/csv_mindex.csv",
                     index_col=["key1", "key2"])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [26]:
result = pd.read_csv("example/ex3.txt", sep="\s+")
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [28]:
pd.read_csv("example/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
 result = pd.read_csv("example/ex5.csv")
 result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
 pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [31]:
 result = pd.read_csv("example/ex5.csv", na_values=["NULL"])
 result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
result2 = pd.read_csv("example/ex5.csv", keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [34]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [36]:
result3 = pd.read_csv("example/ex5.csv", keep_default_na=False,
                      na_values=["NA"])
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [37]:
 result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [38]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
pd.read_csv("example/ex5.csv", na_values=sentinels,
            keep_default_na=False)
pd.options.display.max_rows = 10
result = pd.read_csv("example/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [39]:
chunker = pd.read_csv("example/ex6.csv", chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [40]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [41]:
 data = pd.read_csv("example/ex5.csv")
 data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
 data.to_csv("example/out.csv")

In [44]:
 import sys
 data.to_csv(sys.stdout, sep="|")
 data.to_csv(sys.stdout, na_rep="NULL")
 data.to_csv(sys.stdout, index=False, header=False)
 data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo
,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo
one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo
a,b,c
1,2,3.0
5,6,
9,10,11.0

In [45]:
 import csv
 f = open("example/ex7.csv")
 reader = csv.reader(f)
 for line in reader:
    print(line)
 f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [47]:
 with open("example/ex7.csv") as f:
    lines = list(csv.reader(f))
 header, values = lines[0], lines[1:]
 data_dict = {h: v for h, v in zip(header, zip(*values))}
 data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [48]:
obj = """
 {"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", 
"soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", 
"art"]}]
 }
 """

In [50]:
 import json
 result = json.loads(obj)
 result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [51]:
 asjson = json.dumps(result)
 asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [52]:
 siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])
 siblings

    name  age
0  Scott   34
1  Katie   42

In [55]:
data = pd.read_json("example/example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
 data.to_json(sys.stdout)
 data.to_json(sys.stdout, orient="records")

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [59]:
 tables = pd.read_html("example/fdic_failed_bank_list.html")
 len(tables)
 failures = tables[0]
 failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [60]:
 close_timestamps = pd.to_datetime(failures["Closing Date"])
 close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64